Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/boards.txt
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableAllArdLogs=Enable all
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableAllArdLogs.build.show_arduino_logs_flags=-DArduino_LOGS_ALL
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableArdErrLogs=Error logs
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableArdErrLogs.build.show_arduino_logs_flags=-DArduino_LOGS_ERR
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableArdInfLogs=Info logs
Ameba_AMB82-MINI.menu.09_Ard_logs.EnableArdInfLogs.build.show_arduino_logs_flags=-DArduino_LOGS_INFO
Ameba_AMB82-MINI.menu.09_Ard_logs.DisableAllLogs=Disable all
Ameba_AMB82-MINI.menu.09_Ard_logs.DisableAllLogs.build.show_arduino_logs_flags=

Ameba_AMB82-MINI.menu.10_system_mm_logs.EnableAllLogs=Enable all
Ameba_AMB82-MINI.menu.10_system_mm_logs.EnableAllLogs.build.show_mm_logs_flags=-DArduino_SHOW_ALL_LOGS
Ameba_AMB82-MINI.menu.10_system_mm_logs.VideoLogsOnly=Video/OSD logs only
Ameba_AMB82-MINI.menu.10_system_mm_logs.VideoLogsOnly.build.show_mm_logs_flags=-DArduino_SHOW_VIDEO_OSD_LOGS
Ameba_AMB82-MINI.menu.10_system_mm_logs.NNLogsOnly=NN/OSD logs only
Ameba_AMB82-MINI.menu.10_system_mm_logs.NNLogsOnly.build.show_mm_logs_flags=-DArduino_SHOW_NN_OSD_LOGS
Ameba_AMB82-MINI.menu.10_system_mm_logs.DisableVidAndNNLogs=Disable all
Ameba_AMB82-MINI.menu.10_system_mm_logs.DisableVidAndNNLogs.build.show_mm_logs_flags=

Ameba_AMB82-MINI.menu.11_system_wifi_logs.EnableWiFiLogs=Enable
Ameba_AMB82-MINI.menu.11_system_wifi_logs.EnableWiFiLogs.build.show_wifi_logs_flags=-DArduino_SHOW_WIFI_LOGS
Ameba_AMB82-MINI.menu.11_system_wifi_logs.DisableWiFiLogs=Disable
Ameba_AMB82-MINI.menu.11_system_wifi_logs.DisableWiFiLogs.build.show_wifi_logs_flags=

Ameba_AMB82-MINI.menu.12_all_logs.DisableHardMuteLogs=Disable
Ameba_AMB82-MINI.menu.12_all_logs.DisableHardMuteLogs.build.hardmute_logs_flags=
Ameba_AMB82-MINI.menu.12_all_logs.EnableHardMuteLogs=Enable
Ameba_AMB82-MINI.menu.12_all_logs.EnableHardMuteLogs.build.hardmute_logs_flags=-DArduino_LOGS_HARD_MUTE

Ameba_AMB82-MINI.menu.13_Watchdog.DisableWatchdog=Disable
Ameba_AMB82-MINI.menu.13_Watchdog.DisableWatchdog.build.watchdog_flags=
Ameba_AMB82-MINI.menu.13_Watchdog.EnableWatchdog=Enable
Ameba_AMB82-MINI.menu.13_Watchdog.EnableWatchdog.build.watchdog_flags=-DArduino_WATCHDOG

### Ameba_AMB82-MINI.menu.14_CompliationMode.FastMode=FastMode
### Ameba_AMB82-MINI.menu.14_CompliationMode.FastMode.build.compile_mode=Comepile_Fast_Mode
### Ameba_AMB82-MINI.menu.14_CompliationMode.FastMode.build.compile_mode_flag=-DComepile_Fast_Mode
### Ameba_AMB82-MINI.menu.14_CompliationMode.DevMode=DevMode
### Ameba_AMB82-MINI.menu.14_CompliationMode.DevMode.build.compile_mode=Comepile_Dev_Mode
### Ameba_AMB82-MINI.menu.14_CompliationMode.DevMode.build.compile_mode_flag=-DComepile_Dev_Mode

##############################################################

Ameba_AMB82-ZERO.name=AMB82-ZERO
#Ameba_AMB82-ZERO.vid.0=0x1A86
#Ameba_AMB82-ZERO.pid.0=0x7523

Ameba_AMB82-ZERO.build.tarch=Arm-v8M
Ameba_AMB82-ZERO.build.mcu=RTL8735B
Ameba_AMB82-ZERO.build.f_cpu=500000000L
Ameba_AMB82-ZERO.build.usb_product="AMB82-ZERO"
Ameba_AMB82-ZERO.build.board=AMEBA
Ameba_AMB82-ZERO.build.core=ambpro2
Ameba_AMB82-ZERO.build.extra_flags=-DARDUINO_SDK -DARDUINO_AMBPRO2 -DCORE_RTL8735B -DBOARD_AMB82_ZERO {build.usb_flags} {build.menu_flags}
Ameba_AMB82-ZERO.build.ldscript=linker_scripts/gcc/amebapro2_ram_arduino.ld
Ameba_AMB82-ZERO.build.variant=ameba_amb82-zero

Ameba_AMB82-ZERO.build.menu_flags={build.Arduino_STD_PRINTF_flags} {build.Arduino_LOAD_MODEL_flags} {build.ota_mode_flags} {build.fcs_mode_flags} {build.show_arduino_logs_flags} {build.show_mm_logs_flags} {build.show_wifi_logs_flags} {build.hardmute_logs_flags} {build.watchdog_flags} {build.sensor_flags}
### {build.compile_mode_flag}

Ameba_AMB82-ZERO.upload.tool=ameba_pro2_tools
Ameba_AMB82-ZERO.upload.protocol=usb_serial
Ameba_AMB82-ZERO.upload.maximum_size=16777216
Ameba_AMB82-ZERO.upload.use_1200bps_touch=false
Ameba_AMB82-ZERO.upload.wait_for_upload_port=false
Ameba_AMB82-ZERO.upload.native_usb=false
Ameba_AMB82-ZERO.upload.auto_mode=Disable
Ameba_AMB82-ZERO.upload.erase_flash=Disable
Ameba_AMB82-ZERO.upload.speed=2000000

Ameba_AMB82-ZERO.menu.01_AutoUploadMode.Disable=Disable
Ameba_AMB82-ZERO.menu.01_AutoUploadMode.Disable.upload.auto_mode=Disable
Ameba_AMB82-ZERO.menu.01_AutoUploadMode.Enable=Enable
Ameba_AMB82-ZERO.menu.01_AutoUploadMode.Enable.upload.auto_mode=Enable

Ameba_AMB82-ZERO.menu.02_UploadBaudrate.2M=2000000
Ameba_AMB82-ZERO.menu.02_UploadBaudrate.2M.upload.speed=2000000
Ameba_AMB82-ZERO.menu.02_UploadBaudrate.1M=1000000
Ameba_AMB82-ZERO.menu.02_UploadBaudrate.1M.upload.speed=1000000
Ameba_AMB82-ZERO.menu.02_UploadBaudrate.230400=230400
Ameba_AMB82-ZERO.menu.02_UploadBaudrate.230400.upload.speed=230400

Ameba_AMB82-ZERO.menu.03_EraseFlash.Disable=Disable
Ameba_AMB82-ZERO.menu.03_EraseFlash.Disable.upload.erase_flash=Disable
Ameba_AMB82-ZERO.menu.03_EraseFlash.Enable=Erase only
Ameba_AMB82-ZERO.menu.03_EraseFlash.Enable.upload.erase_flash=Enable
Ameba_AMB82-ZERO.menu.03_EraseFlash.EnableUpload=Erase then Upload
Ameba_AMB82-ZERO.menu.03_EraseFlash.EnableUpload.upload.erase_flash=Enable_Upload

Ameba_AMB82-ZERO.menu.04_CameraOption.f37=JXF37
Ameba_AMB82-ZERO.menu.04_CameraOption.f37.build.camera_opt=SENSOR_F37
Ameba_AMB82-ZERO.menu.04_CameraOption.f37.build.sensor_flags=-DARDUINO_SENSOR_F37
Ameba_AMB82-ZERO.menu.04_CameraOption.f53=JXF53
Ameba_AMB82-ZERO.menu.04_CameraOption.f53.build.camera_opt=SENSOR_F53
Ameba_AMB82-ZERO.menu.04_CameraOption.f53.build.sensor_flags=-DARDUINO_SENSOR_F53
Ameba_AMB82-ZERO.menu.04_CameraOption.gc2053=GC2053
Ameba_AMB82-ZERO.menu.04_CameraOption.gc2053.build.camera_opt=SENSOR_GC2053
Ameba_AMB82-ZERO.menu.04_CameraOption.gc2053.build.sensor_flags=-DARDUINO_SENSOR_GC2053
Ameba_AMB82-ZERO.menu.04_CameraOption.gc4653=GC4653
Ameba_AMB82-ZERO.menu.04_CameraOption.gc4653.build.camera_opt=SENSOR_GC4653
Ameba_AMB82-ZERO.menu.04_CameraOption.gc4653.build.sensor_flags=-DARDUINO_SENSOR_GC4653
Ameba_AMB82-ZERO.menu.04_CameraOption.gc5035=GC5035
Ameba_AMB82-ZERO.menu.04_CameraOption.gc5035.build.camera_opt=SENSOR_GC5035
Ameba_AMB82-ZERO.menu.04_CameraOption.gc5035.build.sensor_flags=-DARDUINO_SENSOR_GC5035
Ameba_AMB82-ZERO.menu.04_CameraOption.imx307=IMX307
Ameba_AMB82-ZERO.menu.04_CameraOption.imx307.build.camera_opt=SENSOR_IMX307
Ameba_AMB82-ZERO.menu.04_CameraOption.imx307.build.sensor_flags=-DARDUINO_SENSOR_IMX307
Ameba_AMB82-ZERO.menu.04_CameraOption.imx327=IMX327
Ameba_AMB82-ZERO.menu.04_CameraOption.imx327.build.camera_opt=SENSOR_IMX327
Ameba_AMB82-ZERO.menu.04_CameraOption.imx327.build.sensor_flags=-DARDUINO_SENSOR_IMX327
Ameba_AMB82-ZERO.menu.04_CameraOption.imx662=IMX662
Ameba_AMB82-ZERO.menu.04_CameraOption.imx662.build.camera_opt=SENSOR_IMX662
Ameba_AMB82-ZERO.menu.04_CameraOption.imx662.build.sensor_flags=-DARDUINO_SENSOR_IMX662
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681=IMX681
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681.build.camera_opt=SENSOR_IMX681
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681.build.sensor_flags=-DARDUINO_SENSOR_IMX681
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m=IMX681_5M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m.build.camera_opt=SENSOR_IMX681_5M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m.build.sensor_flags=-DARDUINO_SENSOR_IMX681_5M
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m=IMX681_12M
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m.build.camera_opt=SENSOR_IMX681_12M
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m.build.sensor_flags=-DARDUINO_SENSOR_IMX681_12M
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m_seq=IMX681_12M_SEQ
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m_seq.build.camera_opt=SENSOR_IMX681_12M_SEQ
Ameba_AMB82-ZERO.menu.04_CameraOption.imx681_12m_seq.build.sensor_flags=-DARDUINO_SENSOR_IMX681_12M_SEQ
Ameba_AMB82-ZERO.menu.04_CameraOption.ps5268=PS5268
Ameba_AMB82-ZERO.menu.04_CameraOption.ps5268.build.camera_opt=SENSOR_PS5268
Ameba_AMB82-ZERO.menu.04_CameraOption.ps5268.build.sensor_flags=-DARDUINO_SENSOR_PS5268
Ameba_AMB82-ZERO.menu.04_CameraOption.ov9734=OV9734
Ameba_AMB82-ZERO.menu.04_CameraOption.ov9734.build.camera_opt=SENSOR_OV9734
Ameba_AMB82-ZERO.menu.04_CameraOption.ov9734.build.sensor_flags=-DARDUINO_SENSOR_OV9734
Ameba_AMB82-ZERO.menu.04_CameraOption.ov50a40=OV50A40
Ameba_AMB82-ZERO.menu.04_CameraOption.ov50a40.build.camera_opt=SENSOR_OV50A40
Ameba_AMB82-ZERO.menu.04_CameraOption.ov50a40.build.sensor_flags=-DARDUINO_SENSOR_OV50A40
Ameba_AMB82-ZERO.menu.04_CameraOption.sc2336=SC2336
Ameba_AMB82-ZERO.menu.04_CameraOption.sc2336.build.camera_opt=SENSOR_SC2336
Ameba_AMB82-ZERO.menu.04_CameraOption.sc2336.build.sensor_flags=-DARDUINO_SENSOR_SC2336
Ameba_AMB82-ZERO.menu.04_CameraOption.k306p=K306P
Ameba_AMB82-ZERO.menu.04_CameraOption.k306p.build.camera_opt=SENSOR_K306P
Ameba_AMB82-ZERO.menu.04_CameraOption.k306p.build.sensor_flags=-DARDUINO_SENSOR_K306P

Ameba_AMB82-ZERO.menu.05_FCSMode.Disable=Disable
Ameba_AMB82-ZERO.menu.05_FCSMode.Disable.build.fcs_mode_val=Disable
Ameba_AMB82-ZERO.menu.05_FCSMode.Disable.build.fcs_mode_flags=
Ameba_AMB82-ZERO.menu.05_FCSMode.Enable=Enable
Ameba_AMB82-ZERO.menu.05_FCSMode.Enable.build.fcs_mode_val=Enable
Ameba_AMB82-ZERO.menu.05_FCSMode.Enable.build.fcs_mode_flags=-DArduino_FCS_MODE

Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.flash=Flash
Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.flash.build.Arduino_LOAD_MODEL_flags=-DArduino_LOAD_MODEL_FLASH
Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.flash.build.model_src=LoadFromFlash
Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.sd=SD Card
Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.sd.build.Arduino_LOAD_MODEL_flags=-DArduino_LOAD_MODEL_SD
Ameba_AMB82-ZERO.menu.06_LoadNNModelSource.sd.build.model_src=LoadFromSD

