Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/boards.txt
Ameba_AMB82-ZERO.menu.07_OTAMode.Disable=Disable
Ameba_AMB82-ZERO.menu.07_OTAMode.Disable.build.ota_mode_val=Disable
Ameba_AMB82-ZERO.menu.07_OTAMode.Disable.build.ota_mode_flags=
Ameba_AMB82-ZERO.menu.07_OTAMode.Enable=Enable
Ameba_AMB82-ZERO.menu.07_OTAMode.Enable.build.ota_mode_val=Enable
Ameba_AMB82-ZERO.menu.07_OTAMode.Enable.build.ota_mode_flags=-DArduino_OTA_MODE

Ameba_AMB82-ZERO.menu.08_StdLibInit.Enable=Arduino_STD_PRINTF
Ameba_AMB82-ZERO.menu.08_StdLibInit.Enable.build.Arduino_STD_PRINTF_flags=-DArduino_STD_PRINTF
Ameba_AMB82-ZERO.menu.08_StdLibInit.Disable=Disable
Ameba_AMB82-ZERO.menu.08_StdLibInit.Disable.build.Arduino_STD_PRINTF_flags=

Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableAllArdLogs=Enable all
Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableAllArdLogs.build.show_arduino_logs_flags=-DArduino_LOGS_ALL
Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableArdErrLogs=Error logs
Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableArdErrLogs.build.show_arduino_logs_flags=-DArduino_LOGS_ERR
Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableArdInfLogs=Info logs
Ameba_AMB82-ZERO.menu.09_Ard_logs.EnableArdInfLogs.build.show_arduino_logs_flags=-DArduino_LOGS_INFO
Ameba_AMB82-ZERO.menu.09_Ard_logs.DisableAllLogs=Disable all
Ameba_AMB82-ZERO.menu.09_Ard_logs.DisableAllLogs.build.show_arduino_logs_flags=

Ameba_AMB82-ZERO.menu.10_system_mm_logs.EnableAllLogs=Enable all
Ameba_AMB82-ZERO.menu.10_system_mm_logs.EnableAllLogs.build.show_mm_logs_flags=-DArduino_SHOW_ALL_LOGS
Ameba_AMB82-ZERO.menu.10_system_mm_logs.VideoLogsOnly=Video/OSD logs only
Ameba_AMB82-ZERO.menu.10_system_mm_logs.VideoLogsOnly.build.show_mm_logs_flags=-DArduino_SHOW_VIDEO_OSD_LOGS
Ameba_AMB82-ZERO.menu.10_system_mm_logs.NNLogsOnly=NN/OSD logs only
Ameba_AMB82-ZERO.menu.10_system_mm_logs.NNLogsOnly.build.show_mm_logs_flags=-DArduino_SHOW_NN_OSD_LOGS
Ameba_AMB82-ZERO.menu.10_system_mm_logs.DisableVidAndNNLogs=Disable all
Ameba_AMB82-ZERO.menu.10_system_mm_logs.DisableVidAndNNLogs.build.show_mm_logs_flags=

Ameba_AMB82-ZERO.menu.11_system_wifi_logs.EnableWiFiLogs=Enable
Ameba_AMB82-ZERO.menu.11_system_wifi_logs.EnableWiFiLogs.build.show_wifi_logs_flags=-DArduino_SHOW_WIFI_LOGS
Ameba_AMB82-ZERO.menu.11_system_wifi_logs.DisableWiFiLogs=Disable
Ameba_AMB82-ZERO.menu.11_system_wifi_logs.DisableWiFiLogs.build.show_wifi_logs_flags=

Ameba_AMB82-ZERO.menu.12_all_logs.DisableHardMuteLogs=Disable
Ameba_AMB82-ZERO.menu.12_all_logs.DisableHardMuteLogs.build.hardmute_logs_flags=
Ameba_AMB82-ZERO.menu.12_all_logs.EnableHardMuteLogs=Enable
Ameba_AMB82-ZERO.menu.12_all_logs.EnableHardMuteLogs.build.hardmute_logs_flags=-DArduino_LOGS_HARD_MUTE

Ameba_AMB82-ZERO.menu.13_Watchdog.DisableWatchdog=Disable
Ameba_AMB82-ZERO.menu.13_Watchdog.DisableWatchdog.build.watchdog_flags=
Ameba_AMB82-ZERO.menu.13_Watchdog.EnableWatchdog=Enable
Ameba_AMB82-ZERO.menu.13_Watchdog.EnableWatchdog.build.watchdog_flags=-DArduino_WATCHDOG

### Ameba_AMB82-ZERO.menu.14_CompliationMode.FastMode=FastMode
### Ameba_AMB82-ZERO.menu.14_CompliationMode.FastMode.build.compile_mode=Comepile_Fast_Mode
### Ameba_AMB82-ZERO.menu.14_CompliationMode.FastMode.build.compile_mode_flag=-DComepile_Fast_Mode
### Ameba_AMB82-ZERO.menu.14_CompliationMode.DevMode=DevMode
### Ameba_AMB82-ZERO.menu.14_CompliationMode.DevMode.build.compile_mode=Comepile_Dev_Mode
### Ameba_AMB82-ZERO.menu.14_CompliationMode.DevMode.build.compile_mode_flag=-DComepile_Dev_Mode
